In [1]:
# Square a list using Python
squared_values = []
for number in range(10):
    squared_values.append(number*number)
squared_values

[0, 1, 4, 9, 16, 25, 36, 49, 64, 81]

In [2]:
import numpy as np

In [3]:
vector = np.array(range(10))

In [4]:
vector

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [5]:
type(vector)

numpy.ndarray

In [6]:
scalar = 5

In [7]:
print(vector * scalar)

[ 0  5 10 15 20 25 30 35 40 45]

In [8]:
print(vector * vector)

[ 0  1  4  9 16 25 36 49 64 81]

In [9]:
my_list = [1, 2, 3]
print(my_list)

[1, 2, 3]

In [11]:
my_vector = np.array(my_list)
my_vector

array([1, 2, 3])

In [12]:
my_matrix = np.array([my_list, my_list])
my_matrix

array([[1, 2, 3],
       [1, 2, 3]])

In [13]:
np.hstack([my_list, my_list])

array([1, 2, 3, 1, 2, 3])

In [17]:
my_nested_list = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
my_matrix = np.array(my_nested_list)
print(my_matrix)

[[1 2 3]
 [4 5 6]
 [7 8 9]]

In [19]:
my_matrix[2][1]

8

In [20]:
my_list1 = [[1,2], [3,4]]
my_list2 = [[5,6], [7,8]]

In [21]:
np.hstack([my_list1, my_list2])

array([[1, 2, 5, 6],
       [3, 4, 7, 8]])

In [26]:
saved = np.vstack([my_list1, my_list2])

In [23]:
np.arange(10)

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [24]:
np.arange(0, 10)

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [25]:
np.arange(0, 10, 2)

array([0, 2, 4, 6, 8])

In [27]:
for ele in saved:
    print(ele)

[1 2]
[3 4]
[5 6]
[7 8]

In [28]:
x = np.array(range(6))

In [29]:
x*x

array([ 0,  1,  4,  9, 16, 25])

In [30]:
np.zeros(3)

array([0., 0., 0.])

In [31]:
np.zeros((3,3))

array([[0., 0., 0.],
       [0., 0., 0.],
       [0., 0., 0.]])

In [32]:
np.ones((3,3))

array([[1., 1., 1.],
       [1., 1., 1.],
       [1., 1., 1.]])

In [35]:
np.ones((3,3))*4

array([[4., 4., 4.],
       [4., 4., 4.],
       [4., 4., 4.]])

In [36]:
np.linspace(0, 10, 5)

array([ 0. ,  2.5,  5. ,  7.5, 10. ])

In [37]:
np.linspace(1900, 2000, 11)

array([1900., 1910., 1920., 1930., 1940., 1950., 1960., 1970., 1980.,
       1990., 2000.])

In [38]:
np.eye(3)

array([[1., 0., 0.],
       [0., 1., 0.],
       [0., 0., 1.]])

In [39]:
np.empty((2,3))

array([[0., 0., 0.],
       [0., 0., 0.]])

In [40]:
np.random.rand(3)

array([0.56590682, 0.11846565, 0.80897002])

In [41]:
np.random.rand(3,3)

array([[0.40066355, 0.56933988, 0.75857474],
       [0.09978461, 0.61651472, 0.88874095],
       [0.76289983, 0.48537539, 0.78407828]])

In [42]:
np.random.randn(3,3)

array([[-0.19883763,  0.37586376, -0.99226887],
       [ 0.48234295, -0.22075356, -0.12422959],
       [-0.48403375,  0.3669505 , -0.30609572]])

In [43]:
3 + 2.5 * np.random.randn(2, 4)

array([[5.89009984, 4.10604675, 1.90169442, 1.81374741],
       [1.93970838, 3.59985696, 0.31049748, 4.71514945]])

In [45]:
np.random.randint(1,101,5)

array([ 27,  74, 100,  23,  15])

In [46]:
vector = np.arange(1,10)

In [47]:
vector

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [48]:
print(vector.reshape(3,3))

[[1 2 3]
 [4 5 6]
 [7 8 9]]

In [49]:
vector.reshape(3,3).reshape(-1)

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [50]:
vector = np.arange(1,13)

In [51]:
print(vector.reshape(3,4))

[[ 1  2  3  4]
 [ 5  6  7  8]
 [ 9 10 11 12]]

In [52]:
vector = np.random.randint(1,50,25)

In [53]:
vector

array([35,  5,  4, 40, 39, 46,  9, 38, 28,  4,  1, 42, 21, 46, 25, 38, 26,
       47, 46, 19, 11, 38, 49,  4, 29])

In [54]:
vector.min()

1

In [55]:
vector.max()

49

In [56]:
vector.mean()

27.6

In [57]:
vector.median()

AttributeError: 'numpy.ndarray' object has no attribute 'median'

In [58]:
np.median(vector)

29.0

In [59]:
my_matrix = vector.reshape(5, 5)
my_matrix.shape

(5, 5)

In [60]:
vector = np.array(range(10))

In [61]:
vector[3:8]

array([3, 4, 5, 6, 7])

In [62]:
vector

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [63]:
vector[3:6] = 12

In [64]:
vector

array([ 0,  1,  2, 12, 12, 12,  6,  7,  8,  9])

In [65]:
vector = np.array(range(10))
my_slice = vector[3:7]
my_slice[:] = 20

In [66]:
vector

array([ 0,  1,  2, 20, 20, 20, 20,  7,  8,  9])

In [67]:
vector = np.array(range(10))
my_slice_copy = vector[3:7].copy()
my_slice_copy[:] = 20
print(vector)

[0 1 2 3 4 5 6 7 8 9]

In [68]:
my_slice_copy

array([20, 20, 20, 20])

In [69]:
matrix = np.array(range(1,10)).reshape((3,3))

In [70]:
matrix

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [71]:
matrix[0,0]

1

In [72]:
matrix[0][0]

1

In [73]:
matrix[:,2] # Grab the third column

array([3, 6, 9])

In [74]:
matrix[1,:] # Grab the second row

array([4, 5, 6])

In [75]:
matrix[:2] # grab the first two rows, all columns

array([[1, 2, 3],
       [4, 5, 6]])

In [76]:
matrix[:2,:] # grab the first two rows, all columns

array([[1, 2, 3],
       [4, 5, 6]])

In [77]:
matrix[:,1:] # grab all the rows, but columns starting from 1

array([[2, 3],
       [5, 6],
       [8, 9]])

In [78]:
vector = np.arange(10)
gt2 = vector > 2 # create condition
lt8 = vector < 8 # create condition

In [79]:
gt2

array([False, False, False,  True,  True,  True,  True,  True,  True,
        True])

In [80]:
vector

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [81]:
lt8

array([ True,  True,  True,  True,  True,  True,  True,  True, False,
       False])

In [82]:
selected_gt2 = vector[gt2] # apply condition to select
selected_gt2

array([3, 4, 5, 6, 7, 8, 9])

In [83]:
selected_lt8 = vector[lt8]

In [84]:
selected_lt8

array([0, 1, 2, 3, 4, 5, 6, 7])

In [85]:
vector[vector>2]

array([3, 4, 5, 6, 7, 8, 9])

In [86]:
vector[vector<8]

array([0, 1, 2, 3, 4, 5, 6, 7])

In [87]:
cond = (vector>2) & (vector<7)
vector[cond]

array([3, 4, 5, 6])

In [88]:
cond = (vector>=2) & (vector<=7)
vector[cond]

array([2, 3, 4, 5, 6, 7])

In [89]:
cond = (vector>=2) | (vector<=7)
vector[cond]

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [90]:
vector

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [91]:
vector + vector

array([ 0,  2,  4,  6,  8, 10, 12, 14, 16, 18])

AttributeError: 'numpy.ndarray' object has no attribute 'add'

In [93]:
vector = np.arange(10)
np.max(vector)
np.min(vector)
np.sqrt(vector)
np.log(vector)

sum(vector<5)

C:\Users\mkhaw\AppData\Local\Temp/ipykernel_7976/3621496346.py:5: RuntimeWarning: divide by zero encountered in log
  np.log(vector)

5

In [94]:
vector

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [96]:
vector[vector<5]

array([0, 1, 2, 3, 4])

In [97]:
matrix = np.random.rand(5,5)

In [98]:
matrix

array([[0.94729688, 0.45166907, 0.89881022, 0.76942295, 0.41827813],
       [0.64418732, 0.11940831, 0.6836223 , 0.9748357 , 0.67078372],
       [0.77649203, 0.63313833, 0.25496121, 0.95164308, 0.85119387],
       [0.35625787, 0.77149953, 0.85325934, 0.71126852, 0.35268037],
       [0.84054971, 0.09617731, 0.16982398, 0.40890694, 0.1413716 ]])

In [99]:
np.floor(matrix*1000)/1000

array([[0.947, 0.451, 0.898, 0.769, 0.418],
       [0.644, 0.119, 0.683, 0.974, 0.67 ],
       [0.776, 0.633, 0.254, 0.951, 0.851],
       [0.356, 0.771, 0.853, 0.711, 0.352],
       [0.84 , 0.096, 0.169, 0.408, 0.141]])

In [100]:
np.round(matrix*1000)/1000

array([[0.947, 0.452, 0.899, 0.769, 0.418],
       [0.644, 0.119, 0.684, 0.975, 0.671],
       [0.776, 0.633, 0.255, 0.952, 0.851],
       [0.356, 0.771, 0.853, 0.711, 0.353],
       [0.841, 0.096, 0.17 , 0.409, 0.141]])

In [101]:
matrix = np.arange(1,10).reshape(3,3)

In [102]:
matrix

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [103]:
matrix.sum(axis=1)

array([ 6, 15, 24])

In [104]:
matrix.sum(axis=0)

array([12, 15, 18])

In [105]:
matrix.cumsum()

array([ 1,  3,  6, 10, 15, 21, 28, 36, 45], dtype=int32)

In [106]:
matrix.cumprod()

array([     1,      2,      6,     24,    120,    720,   5040,  40320,
       362880], dtype=int32)

In [107]:
import numpy as np
import pandas as pd

index = ['chrom', 'pos', 'filter']
data = [4, 12345, 38.4]

vector = np.array(data)
data_dict = {'chrom': 4, 'pos': 12345, 'filter': 38.4}

In [108]:
vector

array([4.0000e+00, 1.2345e+04, 3.8400e+01])

In [109]:
s1 = pd.Series(data=data) # Notice the data type is float

In [110]:
s1

0        4.0
1    12345.0
2       38.4
dtype: float64

In [111]:
s1.name='eas503'

In [112]:
s1

0        4.0
1    12345.0
2       38.4
Name: eas503, dtype: float64

In [113]:
s1[0]

4.0

In [114]:
s2 = pd.Series(data=data, index=index, name='genome')

In [115]:
s2

chrom         4.0
pos       12345.0
filter       38.4
Name: genome, dtype: float64

In [116]:
s2[0]

4.0

In [117]:
s2['chrom']

4.0

In [118]:
s1 = pd.Series(data)
s2 = pd.Series(data, index)

In [119]:
s1

0        4.0
1    12345.0
2       38.4
dtype: float64

In [120]:
s2

chrom         4.0
pos       12345.0
filter       38.4
dtype: float64

In [121]:
data = [1, '2s', 34] 
pd.Series(data)

0     1
1    2s
2    34
dtype: object

In [122]:
pd.Series(data_dict)

chrom         4.0
pos       12345.0
filter       38.4
dtype: float64

In [123]:
## Basic operations
header1 = ['chrom', 'pos', 'filter']
data1 = [4, 12345, 38.4]
header2 = ['chrom', 'pos', 'filter', 'qual']
data2 = [3, 4899, 234, 89.9]

s1 = pd.Series(data1, header1)
s2 = pd.Series(data2, header2)
print(s1)
print(s2)

chrom         4.0
pos       12345.0
filter       38.4
dtype: float64
chrom        3.0
pos       4899.0
filter     234.0
qual        89.9
dtype: float64

In [124]:
s1 + s2

chrom         7.0
filter      272.4
pos       17244.0
qual          NaN
dtype: float64

In [125]:
s1 = pd.Series(data1)
s2 = pd.Series(data2)

s1 + s2

0        7.0
1    17244.0
2      272.4
3        NaN
dtype: float64

In [126]:
s2

0       3.0
1    4899.0
2     234.0
3      89.9
dtype: float64

In [127]:
s1

0        4.0
1    12345.0
2       38.4
dtype: float64

In [128]:
## IMPORTANT - with index labels -- operations are based on label
header1 = ['pos', 'filter', 'chrom']
data1 = [12345, 38.4, 4]
header2 = ['chrom', 'pos', 'filter', 'qual']
data2 = [3, 4899, 234, 89.9]

s1 = pd.Series(data1, header1)
s2 = pd.Series(data2, header2)

In [129]:
s1

pos       12345.0
filter       38.4
chrom         4.0
dtype: float64

In [130]:
s2

chrom        3.0
pos       4899.0
filter     234.0
qual        89.9
dtype: float64

In [131]:
s1 + s2

chrom         7.0
filter      272.4
pos       17244.0
qual          NaN
dtype: float64

In [132]:
s3 = pd.Series([1, 2, 3])

In [133]:
s3

0    1
1    2
2    3
dtype: int64

In [134]:
s4 = pd.Series([1, 2, 3, np.nan])

In [135]:
s4

0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64

In [138]:
s4.min()

1.0

In [139]:
s1

pos       12345.0
filter       38.4
chrom         4.0
dtype: float64

In [140]:
s2

chrom        3.0
pos       4899.0
filter     234.0
qual        89.9
dtype: float64

In [141]:
s1 = pd.Series([1, 2, 3])
s2 = pd.Series([4, 5, 6])

In [142]:
s1.add(s2)

0    5
1    7
2    9
dtype: int64

In [146]:
s1.add(s2).div(2).mul(100)

0    250.0
1    350.0
2    450.0
dtype: float64

In [144]:
s1

0    1
1    2
2    3
dtype: int64

In [145]:
s2

0    4
1    5
2    6
dtype: int64

In [147]:
s = pd.Series([0, 1, np.nan, 3])

In [149]:
s

0    0.0
1    1.0
2    NaN
3    3.0
dtype: float64

In [155]:
s.interpolate(method="linear")

0    0.0
1    1.0
2    2.0
3    3.0
dtype: float64

In [156]:
import numpy as np
import pandas as pd

header = ['exam1', 'exam2', 'exam3']
data = np.random.randint(65, 101, 12).reshape(4,3)
students = ['student1', 'student2', 'student3', 'student4']

df = pd.DataFrame(data=data, columns=header)

In [157]:
df

   exam1  exam2  exam3
0     66     84     65
1     81     73     81
2     77     93     84
3     86     94     83

In [158]:
df.describe()

           exam1      exam2      exam3
count   4.000000   4.000000   4.000000
mean   77.500000  86.000000  78.250000
std     8.504901   9.763879   8.920949
min    66.000000  73.000000  65.000000
25%    74.250000  81.250000  77.000000
50%    79.000000  88.500000  82.000000
75%    82.250000  93.250000  83.250000
max    86.000000  94.000000  84.000000

In [159]:
df

   exam1  exam2  exam3
0     66     84     65
1     81     73     81
2     77     93     84
3     86     94     83

In [160]:
df = pd.DataFrame(data=data, index=students, columns=header)

In [161]:
df

          exam1  exam2  exam3
student1     66     84     65
student2     81     73     81
student3     77     93     84
student4     86     94     83

In [166]:
df[['exam1', 'exam2']]

          exam1  exam2
student1     66     84
student2     81     73
student3     77     93
student4     86     94

In [167]:
df.exam1

student1    66
student2    81
student3    77
student4    86
Name: exam1, dtype: int32

In [168]:
df['average'] = (df['exam1'] + df['exam2'] + df['exam3'])/3

In [169]:
df

          exam1  exam2  exam3    average
student1     66     84     65  71.666667
student2     81     73     81  78.333333
student3     77     93     84  84.666667
student4     86     94     83  87.666667

In [170]:
df.drop('average')

KeyError: "['average'] not found in axis"

In [171]:
df.drop('student1')

          exam1  exam2  exam3    average
student2     81     73     81  78.333333
student3     77     93     84  84.666667
student4     86     94     83  87.666667

In [172]:
df

          exam1  exam2  exam3    average
student1     66     84     65  71.666667
student2     81     73     81  78.333333
student3     77     93     84  84.666667
student4     86     94     83  87.666667

In [173]:
df.drop('average', axis=1) # works on column labels

          exam1  exam2  exam3
student1     66     84     65
student2     81     73     81
student3     77     93     84
student4     86     94     83

In [174]:
df

          exam1  exam2  exam3    average
student1     66     84     65  71.666667
student2     81     73     81  78.333333
student3     77     93     84  84.666667
student4     86     94     83  87.666667

In [175]:
df.drop('average', axis=1, inplace=True)

In [176]:
df

          exam1  exam2  exam3
student1     66     84     65
student2     81     73     81
student3     77     93     84
student4     86     94     83

In [177]:
header = ['exam1', 'exam2', 'exam3']
data = np.random.randint(65, 101, 12).reshape(4,3)
students = ['student1', 'student2', 'student3', 'student4']
df = pd.DataFrame(data=data, index=students, columns=header)

In [178]:
df

          exam1  exam2  exam3
student1     98     85     78
student2     91     71     72
student3     72     90     88
student4     65     89     80

In [179]:
df.loc['student1']

exam1    98
exam2    85
exam3    78
Name: student1, dtype: int32

In [180]:
df.iloc[0]

exam1    98
exam2    85
exam3    78
Name: student1, dtype: int32

In [183]:
df.loc['student1']['exam1']

98

In [184]:
df.loc['student1', 'exam1']

98

In [185]:
df.loc['student1', ['exam1', 'exam3']]

exam1    98
exam3    78
Name: student1, dtype: int32

In [186]:
df>=90

          exam1  exam2  exam3
student1   True  False  False
student2   True  False  False
student3  False   True  False
student4  False  False  False

In [188]:
a = df[df>=90]

In [189]:
a.mean()

exam1    94.5
exam2    90.0
exam3     NaN
dtype: float64

In [190]:
a

          exam1  exam2  exam3
student1   98.0    NaN    NaN
student2   91.0    NaN    NaN
student3    NaN   90.0    NaN
student4    NaN    NaN    NaN

In [191]:
df['exam1']>=85

student1     True
student2     True
student3    False
student4    False
Name: exam1, dtype: bool

In [192]:
df[df['exam1']>=85]

          exam1  exam2  exam3
student1     98     85     78
student2     91     71     72

In [193]:
df[df['exam1']>=85]['exam3']

student1    78
student2    72
Name: exam3, dtype: int32

In [194]:
df[df['exam1']>=85][['exam2', 'exam3']]

          exam2  exam3
student1     85     78
student2     71     72

In [195]:
df[(df['exam1']>=85) & (df['exam2']>=85)]

          exam1  exam2  exam3
student1     98     85     78

In [196]:
df[(df['exam1']>=85) & (df['exam2']>=85)]['exam3']

student1    78
Name: exam3, dtype: int32

In [197]:
df[(df['exam1']>=85) | (df['exam2']>=85)]

          exam1  exam2  exam3
student1     98     85     78
student2     91     71     72
student3     72     90     88
student4     65     89     80

In [198]:
header = ['exam1', 'exam2', 'exam3']
data = np.random.randint(65, 101, 12).reshape(4,3)
students = ['student1', 'student2', 'student3', 'student4']
df = pd.DataFrame(data=data, columns=header)
df

   exam1  exam2  exam3
0     87     98     99
1     68     88     74
2     98     88     74
3     77     91     66

In [199]:
df['name'] = students

In [200]:
df

   exam1  exam2  exam3      name
0     87     98     99  student1
1     68     88     74  student2
2     98     88     74  student3
3     77     91     66  student4

In [201]:
df.set_index('name', inplace=True)

In [202]:
df

          exam1  exam2  exam3
name
student1     87     98     99
student2     68     88     74
student3     98     88     74
student4     77     91     66

In [204]:
df.loc['student1']

exam1    87
exam2    98
exam3    99
Name: student1, dtype: int32

In [205]:
df.reset_index(inplace=True)

In [206]:
df

       name  exam1  exam2  exam3
0  student1     87     98     99
1  student2     68     88     74
2  student3     98     88     74
3  student4     77     91     66

In [207]:
df.loc['student1']

KeyError: 'student1'

In [250]:
students = 'student1 student1 student1 student2 student2 student2 student3 student3 student3'
exams = 'exam1 exam2 exam3'.split()*3
classes = 'class1 class2'
index = list(zip(students.split(), exams))
index = pd.MultiIndex.from_tuples(index)
df = pd.DataFrame(np.random.randint(65, 101, 3*3*2).reshape(9,2) , index, classes.split())
df.loc['student1'].loc['exam1']['class1'] 
df.index.names
df.index.names = ['Students', 'Exams']

In [251]:
df

                class1  class2
Students Exams
student1 exam1      74      73
         exam2      98      84
         exam3      76      67
student2 exam1      84      86
         exam2      88      78
         exam3      85      81
student3 exam1      82      72
         exam2      93     100
         exam3      65      75

In [210]:
df['class1']

Students  Exams
student1  exam1    90
          exam2    87
          exam3    84
student2  exam1    89
          exam2    82
          exam3    91
student3  exam1    78
          exam2    82
          exam3    89
Name: class1, dtype: int32

In [255]:
df.loc['student1'].loc['exam1']

class1    74
class2    73
Name: exam1, dtype: int32

In [249]:
df

   Exams  Students  Scores
0  exam1  student1      88
1  exam1  student2      71
2  exam1  student3      79
3  exam2  student1      75
4  exam2  student2      75
5  exam2  student3      97
6  exam3  student1      97
7  exam3  student2      99
8  exam3  student3      65

In [212]:
df.loc['student1'].loc['exam1']

class1    90
class2    95
Name: exam1, dtype: int32

In [213]:
df.xs('student1')

       class1  class2
Exams
exam1      90      95
exam2      87      90
exam3      84      77

In [214]:
df.xs('exam1', level='Exams')

          class1  class2
Students
student1      90      95
student2      89      72
student3      78      81

In [215]:
my_dict = {'student1': [90, 84, np.nan], 'student2': [77, np.nan, np.nan], 'student3': [88, 65, 93]}
df = pd.DataFrame(my_dict)

In [216]:
df

   student1  student2  student3
0      90.0      77.0        88
1      84.0       NaN        65
2       NaN       NaN        93

In [217]:
df.dropna()

   student1  student2  student3
0      90.0      77.0        88

In [218]:
df.dropna(axis=0)

   student1  student2  student3
0      90.0      77.0        88

In [219]:
df.dropna(axis=1)

   student3
0        88
1        65
2        93

In [220]:
df.dropna(thresh=2)

   student1  student2  student3
0      90.0      77.0        88
1      84.0       NaN        65

In [221]:
df.fillna(value=55)

   student1  student2  student3
0      90.0      77.0        88
1      84.0      55.0        65
2      55.0      55.0        93

In [227]:
df.drop(axis=0, labels=[0])

   student1  student2  student3
1      84.0       NaN        65
2       NaN       NaN        93

In [223]:
df

   student1  student2  student3
0      90.0      77.0        88
1      84.0       NaN        65
2       NaN       NaN        93

In [228]:
df.drop(axis=1, columns=['student1'])

   student2  student3
0      77.0        88
1       NaN        65
2       NaN        93

In [229]:
my_dict = {
    'Exams': 'exam1 exam1 exam1'.split() + 'exam2 exam2 exam2'.split() + 'exam3 exam3 exam3'.split(),
    'Students': 'student1 student2 student3'.split()*3,   
    'Scores': np.random.randint(65,101,9)
}
df = pd.DataFrame(my_dict)

In [230]:
df

   Exams  Students  Scores
0  exam1  student1      88
1  exam1  student2      71
2  exam1  student3      79
3  exam2  student1      75
4  exam2  student2      75
5  exam2  student3      97
6  exam3  student1      97
7  exam3  student2      99
8  exam3  student3      65

In [231]:
df.groupby('Students').mean()

             Scores
Students
student1  86.666667
student2  81.666667
student3  80.333333

In [232]:
df.groupby('Students').mean().loc['student1']

Scores    86.666667
Name: student1, dtype: float64

In [233]:
df.groupby('Exams').max()['Scores']

Exams
exam1    88
exam2    97
exam3    99
Name: Scores, dtype: int32

In [236]:
df.groupby('Exams').describe()

      Scores
       count       mean        std   min   25%   50%   75%   max
Exams
exam1    3.0  79.333333   8.504901  71.0  75.0  79.0  83.5  88.0
exam2    3.0  82.333333  12.701706  75.0  75.0  75.0  86.0  97.0
exam3    3.0  87.000000  19.078784  65.0  81.0  97.0  98.0  99.0

In [237]:
df.groupby('Students').describe().transpose()

Students       student1   student2   student3
Scores count   3.000000   3.000000   3.000000
       mean   86.666667  81.666667  80.333333
       std    11.060440  15.143756  16.041613
       min    75.000000  71.000000  65.000000
       25%    81.500000  73.000000  72.000000
       50%    88.000000  75.000000  79.000000
       75%    92.500000  87.000000  88.000000
       max    97.000000  99.000000  97.000000

In [238]:
departments = { 
    'DepartmentId': [1, 2, 3, 4],
    'DepartmentName': ['IT', 'Physics', 'Arts', 'Math'] 
}

df1 = pd.DataFrame(departments)

students = {
    'StudentId': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'StudentName': ['Michael', 'John', 'Jack', 'Sara', 'Sally', 'Jena', 'Nancy', 'Adam', 'Stevens', 'George'],
    'DepartmentId': [1, 1, 1, 2, 2, np.nan, 2, 3, 3, np.nan]
}

df2 = pd.DataFrame(students)

marks = {
    'MarkId': [1, 2, 3, 4, 5, 6, 7, 8],
    'StudentId': [1, 2, 3, 4, 5, 6, 7, 8], 
    'Mark': [18, 20, 16, 19, 14, 20, 20, 20]
}

df3 = pd.DataFrame(marks)

In [239]:
df1

   DepartmentId DepartmentName
0             1             IT
1             2        Physics
2             3           Arts
3             4           Math

In [240]:
df2

   StudentId StudentName  DepartmentId
0          1     Michael           1.0
1          2        John           1.0
2          3        Jack           1.0
3          4        Sara           2.0
4          5       Sally           2.0
5          6        Jena           NaN
6          7       Nancy           2.0
7          8        Adam           3.0
8          9     Stevens           3.0
9         10      George           NaN

In [241]:
df3

   MarkId  StudentId  Mark
0       1          1    18
1       2          2    20
2       3          3    16
3       4          4    19
4       5          5    14
5       6          6    20
6       7          7    20
7       8          8    20

In [243]:
pd.merge(df2, df1, how='inner', on='DepartmentId')

   StudentId StudentName  DepartmentId DepartmentName
0          1     Michael           1.0             IT
1          2        John           1.0             IT
2          3        Jack           1.0             IT
3          4        Sara           2.0        Physics
4          5       Sally           2.0        Physics
5          7       Nancy           2.0        Physics
6          8        Adam           3.0           Arts
7          9     Stevens           3.0           Arts

In [244]:
pd.merge(df1, df2, how='inner', on='DepartmentId')

   DepartmentId DepartmentName  StudentId StudentName
0             1             IT          1     Michael
1             1             IT          2        John
2             1             IT          3        Jack
3             2        Physics          4        Sara
4             2        Physics          5       Sally
5             2        Physics          7       Nancy
6             3           Arts          8        Adam
7             3           Arts          9     Stevens

In [245]:
pd.merge(df2, df1, how='left', on='DepartmentId')

   StudentId StudentName  DepartmentId DepartmentName
0          1     Michael           1.0             IT
1          2        John           1.0             IT
2          3        Jack           1.0             IT
3          4        Sara           2.0        Physics
4          5       Sally           2.0        Physics
5          6        Jena           NaN            NaN
6          7       Nancy           2.0        Physics
7          8        Adam           3.0           Arts
8          9     Stevens           3.0           Arts
9         10      George           NaN            NaN

In [246]:
pd.merge(df3, pd.merge(df2, df1, how='inner', on='DepartmentId'), how='inner', on='StudentId')

   MarkId  StudentId  Mark StudentName  DepartmentId DepartmentName
0       1          1    18     Michael           1.0             IT
1       2          2    20        John           1.0             IT
2       3          3    16        Jack           1.0             IT
3       4          4    19        Sara           2.0        Physics
4       5          5    14       Sally           2.0        Physics
5       7          7    20       Nancy           2.0        Physics
6       8          8    20        Adam           3.0           Arts

In [247]:
data = pd.merge(df3, pd.merge(df2, df1, how='inner', on='DepartmentId'), how='inner', on='StudentId')

In [248]:
data[['StudentName', 'Mark', 'DepartmentName']]

  StudentName  Mark DepartmentName
0     Michael    18             IT
1        John    20             IT
2        Jack    16             IT
3        Sara    19        Physics
4       Sally    14        Physics
5       Nancy    20        Physics
6        Adam    20           Arts